app/resources/api/v1/coach_resource.rb

SELECT "courses".* FROM "courses" WHERE "courses"."coach_id" = $1  [["coach_id", 3]]
SELECT 1 AS one FROM "courses" LIMIT $1  [["LIMIT", 1]]
---
      def courses_exists?
        Course.exists?