app/resources/api/v1/course_resource.rb

      def self.assign_coach(courses, exclude_coaches)
        coach = find_coach exclude_coaches
        courses.each do | course|
          course._model.update_attributes({coach_id: coach.id})
---
UPDATE "courses" SET "coach_id" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["coach_id", 4], ["updated_at", "2021-08-08 13:16:47.070936"], ["id", 1]]